## [liquibase-docs-prod](https://liquibase.app.spacelift.io/stack/liquibase-docs-prod/run/01J4A6526Z91GFRK8ZHV93VH4D) plan logs

<details>
<summary>Click here to expand</summary>

```
...
aws_s3_object.redirects["/mongodb"]: Refreshing state... [id=/mongodb]
aws_s3_object.redirects["/change-types/pro/add-check-constraint.html"]: Refreshing state... [id=/change-types/pro/add-check-constraint.html]
aws_s3_object.redirects["/concepts/advanced/runwith.html"]: Refreshing state... [id=/concepts/advanced/runwith.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.24.0.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.24.0.html]
aws_s3_object.redirects["/tools-integrations/springboot/using-springboot-with-maven.html"]: Refreshing state... [id=/tools-integrations/springboot/using-springboot-with-maven.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-updateTestingRollback.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-updateTestingRollback.html]
aws_s3_object.redirects["/2014/11/popular-topics.html"]: Refreshing state... [id=/2014/11/popular-topics.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-sync-hub.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-sync-hub.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/sybase-enterprise.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/sybase-enterprise.html]
aws_s3_object.redirects["/start/install/tutorials/oracle.html"]: Refreshing state... [id=/start/install/tutorials/oracle.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.4.2.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.4.2.html]
aws_s3_object.redirects["/change-types/community/create-sequence.html"]: Refreshing state... [id=/change-types/community/create-sequence.html]
aws_s3_object.redirects["/commands/config-ref/filter-log-messages.html"]: Refreshing state... [id=/commands/config-ref/filter-log-messages.html]
aws_s3_object.redirects["/commands/quality-checks/run.html"]: Refreshing state... [id=/commands/quality-checks/run.html]
aws_s3_object.redirects["/change-types/pro/drop-check-constraint.html"]: Refreshing state... [id=/change-types/pro/drop-check-constraint.html]
aws_s3_object.redirects["/concepts/basic/liquibase-relative-path-best-practices.html"]: Refreshing state... [id=/concepts/basic/liquibase-relative-path-best-practices.html]
aws_s3_object.redirects["/documentation/maven/maven_updatetestingrollback.html"]: Refreshing state... [id=/documentation/maven/maven_updatetestingrollback.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-generateChangeLog.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-generateChangeLog.html]
aws_s3_object.redirects["/start/tutorials/postgresql/postgres-azure-database.html"]: Refreshing state... [id=/start/tutorials/postgresql/postgres-azure-database.html]
aws_s3_object.redirects["/start/getting-started-with-liquibase-and-xml-on-linux-macos.html"]: Refreshing state... [id=/start/getting-started-with-liquibase-and-xml-on-linux-macos.html]
aws_s3_object.redirects["/install/tutorials/firebird.html"]: Refreshing state... [id=/install/tutorials/firebird.html]
aws_s3_object.redirects["/commands/quality-checks/concepts/getting-started-with-the-checks-command.html"]: Refreshing state... [id=/commands/quality-checks/concepts/getting-started-with-the-checks-command.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.6.2.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.6.2.html]
aws_s3_object.redirects["/commands/config-ref/headless-parameter.html"]: Refreshing state... [id=/commands/config-ref/headless-parameter.html]
aws_s3_object.redirects["/feature-flags/readmes/launchdarkly feature flags.html"]: Refreshing state... [id=/feature-flags/readmes/launchdarkly feature flags.html]
aws_s3_object.redirects["/parameters/object-quoting-strategy.html"]: Refreshing state... [id=/parameters/object-quoting-strategy.html]
aws_s3_object.redirects["/concepts/changelogs/attributes/using-psql-integration.html"]: Refreshing state... [id=/concepts/changelogs/attributes/using-psql-integration.html]
aws_s3_object.redirects["/commands/registerchangelog.html"]: Refreshing state... [id=/commands/registerchangelog.html]
aws_s3_object.redirects["/concepts/advanced/exception-handling.html"]: Refreshing state... [id=/concepts/advanced/exception-handling.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/mssql-integrated-security-kerberos-authentication.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/mssql-integrated-security-kerberos-authentication.html]
aws_s3_object.redirects["/start/getting-started-liquibase-sql-linux.html"]: Refreshing state... [id=/start/getting-started-liquibase-sql-linux.html]
aws_s3_object.redirects["/commands/unexpectedchangesets.html"]: Refreshing state... [id=/commands/unexpectedchangesets.html]
aws_s3_object.redirects["/secrets-management/home.html"]: Refreshing state... [id=/secrets-management/home.html]
aws_s3_object.redirects["/start/tutorials/mongodb-pro.html"]: Refreshing state... [id=/start/tutorials/mongodb-pro.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/cloud-spanner.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/cloud-spanner.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/oracle-atp-db.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/oracle-atp-db.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-changelogSyncSQL.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-changelogSyncSQL.html]
aws_s3_object.redirects["/tools-integrations/extensions/extension-upgrade-guides/lb-2.0-upgrade-guide.html"]: Refreshing state... [id=/tools-integrations/extensions/extension-upgrade-guides/lb-2.0-upgrade-guide.html]
aws_s3_object.redirects["/concepts/basic/home.html"]: Refreshing state... [id=/concepts/basic/home.html]
aws_s3_object.redirects["/start/tutorials/yugabytedb.html"]: Refreshing state... [id=/start/tutorials/yugabytedb.html]
aws_s3_object.redirects["/concepts/advanced/should-run-parameter.html"]: Refreshing state... [id=/concepts/advanced/should-run-parameter.html]
aws_s3_object.redirects["/commands/config-ref/generated-changeset-ids-contains-description.html"]: Refreshing state... [id=/commands/config-ref/generated-changeset-ids-contains-description.html]
aws_s3_object.redirects["/start/tutorials/mongo-db-atlas-config.html"]: Refreshing state... [id=/start/tutorials/mongo-db-atlas-config.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.6.0-0.1.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.6.0-0.1.html]
aws_s3_object.redirects["/start/get-started/getting-started-liquibase-yaml-macos.html"]: Refreshing state... [id=/start/get-started/getting-started-liquibase-yaml-macos.html]
aws_s3_object.redirects["/start/tutorials/cassandra.html"]: Refreshing state... [id=/start/tutorials/cassandra.html]
aws_s3_object.redirects["/tools-integrations/feature-flags/readmes/flagsmith-feature-flags-extension.html"]: Refreshing state... [id=/tools-integrations/feature-flags/readmes/flagsmith-feature-flags-extension.html]
aws_s3_object.redirects["/tools-integrations/remote-files/create-changelogs-s3.html"]: Refreshing state... [id=/tools-integrations/remote-files/create-changelogs-s3.html]
aws_s3_object.redirects["/concepts/changelogs/attributes/include.html"]: Refreshing state... [id=/concepts/changelogs/attributes/include.html]
aws_s3_object.redirects["/concepts/basic/other-formats.html"]: Refreshing state... [id=/concepts/basic/other-formats.html]
aws_s3_object.redirects["/commands/community/status-verbose.html"]: Refreshing state... [id=/commands/community/status-verbose.html]
aws_s3_object.redirects["/commands/community/rollbackcountsql.html"]: Refreshing state... [id=/commands/community/rollbackcountsql.html]
aws_s3_object.redirects["/install/tutorials/cosmosdb.html"]: Refreshing state... [id=/install/tutorials/cosmosdb.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.17.0.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.17.0.html]
aws_s3_object.redirects["/change-types/community/load-update-data.html"]: Refreshing state... [id=/change-types/community/load-update-data.html]
aws_s3_object.redirects["/change-types/community/modify-data-type.html"]: Refreshing state... [id=/change-types/community/modify-data-type.html]
aws_s3_object.redirects["/install/tutorials/yugabytedb.html"]: Refreshing state... [id=/install/tutorials/yugabytedb.html]
aws_s3_object.redirects["/commands/snapshot/snapshot.html"]: Refreshing state... [id=/commands/snapshot/snapshot.html]
aws_s3_object.redirects["/commands/quality-checks/checks/database-checks/object-name-must-match.html"]: Refreshing state... [id=/commands/quality-checks/checks/database-checks/object-name-must-match.html]
aws_s3_object.redirects["/commands/config-ref/logfile-parameter.html"]: Refreshing state... [id=/commands/config-ref/logfile-parameter.html]
aws_s3_object.redirects["/commands/quality-checks/delete.html"]: Refreshing state... [id=/commands/quality-checks/delete.html]
aws_s3_object.redirects["/change-types/community/execute-command.html"]: Refreshing state... [id=/change-types/community/execute-command.html]
aws_s3_object.redirects["/commands/community/home.html"]: Refreshing state... [id=/commands/community/home.html]
aws_s3_object.redirects["/commands/pro/home.html"]: Refreshing state... [id=/commands/pro/home.html]
aws_s3_object.redirects["/start/release-notes/4.24.0.html"]: Refreshing state... [id=/start/release-notes/4.24.0.html]
aws_s3_object.redirects["/tools-integrations/liquibase-hub/organizations.html"]: Refreshing state... [id=/tools-integrations/liquibase-hub/organizations.html]
aws_s3_object.redirects["/commands/community/updatecount.html"]: Refreshing state... [id=/commands/community/updatecount.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/redshift.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/redshift.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/tutorial-using-oracle.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/tutorial-using-oracle.html]
aws_s3_object.redirects["/commands/community/future-rollback-from-tag-sql.html"]: Refreshing state... [id=/commands/community/future-rollback-from-tag-sql.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.5.0.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.5.0.html]
aws_s3_object.redirects["/commands/java-opts-environment-variable.html"]: Refreshing state... [id=/commands/java-opts-environment-variable.html]
aws_s3_object.redirects["/commands/quality-checks/json-object.html"]: Refreshing state... [id=/commands/quality-checks/json-object.html]
aws_s3_object.redirects["/commands/quality-checks/checks-customize.html"]: Refreshing state... [id=/commands/quality-checks/checks-customize.html]
aws_s3_object.redirects["/install/tutorials/mssql-windows-integrated-security.html"]: Refreshing state... [id=/install/tutorials/mssql-windows-integrated-security.html]
aws_s3_object.redirects["/install/liquibase-windows.html"]: Refreshing state... [id=/install/liquibase-windows.html]
aws_s3_object.redirects["/documentation/changeset"]: Refreshing state... [id=/documentation/changeset]
aws_s3_object.redirects["/commands/quality-checks/checks/quality-checks-databases.html"]: Refreshing state... [id=/commands/quality-checks/checks/quality-checks-databases.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/faq.html"]: Refreshing state... [id=/tools-integrations/maven/commands/faq.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/hibernate.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/hibernate.html]
aws_s3_object.redirects["/install/tutorials/interbase.html"]: Refreshing state... [id=/install/tutorials/interbase.html]
aws_s3_object.redirects["/concepts/advanced/generate-changeset-created-values.html"]: Refreshing state... [id=/concepts/advanced/generate-changeset-created-values.html]
aws_s3_object.redirects["/start/get-started/getting-started-liquibase-sql-macos.html"]: Refreshing state... [id=/start/get-started/getting-started-liquibase-sql-macos.html]
aws_s3_object.redirects["/commands/snapshot.html"]: Refreshing state... [id=/commands/snapshot.html]
aws_s3_object.redirects["/concepts/advanced/output-line-separator.html"]: Refreshing state... [id=/concepts/advanced/output-line-separator.html]
aws_s3_object.redirects["/commands/quality-checks/checks/changeset-context-check.html"]: Refreshing state... [id=/commands/quality-checks/checks/changeset-context-check.html]
aws_s3_object.redirects["/commands/quality-checks/disable.html"]: Refreshing state... [id=/commands/quality-checks/disable.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-update-testing-rollback.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-update-testing-rollback.html]
aws_s3_object.redirects["/start/install/tutorials/mssql.html"]: Refreshing state... [id=/start/install/tutorials/mssql.html]
aws_s3_object.redirects["/change-types/community/add-lookup-table.html"]: Refreshing state... [id=/change-types/community/add-lookup-table.html]
aws_s3_object.redirects["/commands/quality-checks/checks/sql-user-defined-pattern-check.html"]: Refreshing state... [id=/commands/quality-checks/checks/sql-user-defined-pattern-check.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-rollback-one-changeset-sql.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-rollback-one-changeset-sql.html]
aws_s3_object.redirects["/start/install/tutorials/impala-hive.html"]: Refreshing state... [id=/start/install/tutorials/impala-hive.html]
aws_s3_object.redirects["/change-types/community/insert.html"]: Refreshing state... [id=/change-types/community/insert.html]
aws_s3_object.redirects["/start/tutorials/cloud-spanner.html"]: Refreshing state... [id=/start/tutorials/cloud-spanner.html]
aws_s3_object.redirects["/start/install/tutorials/mongo-db-atlas-config.html"]: Refreshing state... [id=/start/install/tutorials/mongo-db-atlas-config.html]
aws_s3_object.redirects["/change-types/community/drop-foreign-key-constraint.html"]: Refreshing state... [id=/change-types/community/drop-foreign-key-constraint.html]
aws_s3_object.redirects["/concepts/advanced/should-snapshot-data-parameter.html"]: Refreshing state... [id=/concepts/advanced/should-snapshot-data-parameter.html]
aws_s3_object.redirects["/concepts/advanced/convert-data-types-parameter.html"]: Refreshing state... [id=/concepts/advanced/convert-data-types-parameter.html]
aws_s3_object.redirects["/commands/config-ref/driver.html"]: Refreshing state... [id=/commands/config-ref/driver.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-drop-all.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-drop-all.html]
aws_s3_object.redirects["/install/liquibase-installation-troubleshooting.html"]: Refreshing state... [id=/install/liquibase-installation-troubleshooting.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/h2.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/h2.html]
aws_s3_object.redirects["/tools-integrations/liquibase-hub/auto-registration-and-report-links.html"]: Refreshing state... [id=/tools-integrations/liquibase-hub/auto-registration-and-report-links.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-listLocks.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-listLocks.html]
aws_s3_object.redirects["/install/tutorials/connecting-to-an-oracle-database-with-liquibase-kerberos-and-ad.html"]: Refreshing state... [id=/install/tutorials/connecting-to-an-oracle-database-with-liquibase-kerberos-and-ad.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/cockroachdb.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/cockroachdb.html]
aws_s3_object.redirects["/change-types/pro/create-synonym.html"]: Refreshing state... [id=/change-types/pro/create-synonym.html]
aws_s3_object.redirects["/start/tutorials/mongodb-db-atlas-config.html"]: Refreshing state... [id=/start/tutorials/mongodb-db-atlas-config.html]
aws_s3_object.redirects["/drift-reports"]: Refreshing state... [id=/drift-reports]
aws_s3_object.redirects["/change-types/pro/enable-check-constraint.html"]: Refreshing state... [id=/change-types/pro/enable-check-constraint.html]
aws_s3_object.redirects["/install/tutorials/db2onzdeploy-sql.html"]: Refreshing state... [id=/install/tutorials/db2onzdeploy-sql.html]
aws_s3_object.redirects["/commands/quality-checks/quality-checks-list.html"]: Refreshing state... [id=/commands/quality-checks/quality-checks-list.html]
aws_s3_object.redirects["/start/install/tutorials/cassandra.html"]: Refreshing state... [id=/start/install/tutorials/cassandra.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-deactivatechangelog.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-deactivatechangelog.html]
aws_s3_object.redirects["/install/tutorials/sqlite.html"]: Refreshing state... [id=/install/tutorials/sqlite.html]
aws_s3_object.redirects["/commands/update/validate.html"]: Refreshing state... [id=/commands/update/validate.html]
aws_s3_object.redirects["/commands/quality-checks/using-quality-checks-in-automation-severity-and-exit-code.html"]: Refreshing state... [id=/commands/quality-checks/using-quality-checks-in-automation-severity-and-exit-code.html]
aws_s3_object.redirects["/commands/change-tracking/changelog-sync.html"]: Refreshing state... [id=/commands/change-tracking/changelog-sync.html]
aws_s3_object.redirects["/change-types/community/create-index.html"]: Refreshing state... [id=/change-types/community/create-index.html]
aws_s3_object.redirects["/tools-integrations/springboot/using-springboot-sql-plus-kerberos.html"]: Refreshing state... [id=/tools-integrations/springboot/using-springboot-sql-plus-kerberos.html]
aws_s3_object.redirects["/concepts/advanced/liquibase-schema-name-parameter.html"]: Refreshing state... [id=/concepts/advanced/liquibase-schema-name-parameter.html]
aws_s3_object.redirects["/commands/future-rollback-from-tag-sql.html"]: Refreshing state... [id=/commands/future-rollback-from-tag-sql.html]
aws_s3_object.redirects["/install/tutorials/mariadb.html"]: Refreshing state... [id=/install/tutorials/mariadb.html]
aws_s3_object.redirects["/start/install/tutorials/percona-xtradb-cluster.html"]: Refreshing state... [id=/start/install/tutorials/percona-xtradb-cluster.html]
aws_s3_object.redirects["/commands/init/hub.html"]: Refreshing state... [id=/commands/init/hub.html]
aws_s3_object.redirects["/start/getting-started-with-liquibase-and-json-on-windows.html"]: Refreshing state... [id=/start/getting-started-with-liquibase-and-json-on-windows.html]
aws_s3_object.redirects["/commands/quality-checks/table-comment-pattern-check.html"]: Refreshing state... [id=/commands/quality-checks/table-comment-pattern-check.html]
aws_s3_object.redirects["/start/getting-started-liquibase-json-windows.html"]: Refreshing state... [id=/start/getting-started-liquibase-json-windows.html]
aws_s3_object.redirects["/concepts/advanced/liquibase-tablespace-name.html"]: Refreshing state... [id=/concepts/advanced/liquibase-tablespace-name.html]
aws_s3_object.redirects["/flow.html"]: Refreshing state... [id=/flow.html]
aws_s3_object.redirects["/concepts/changeset.html"]: Refreshing state... [id=/concepts/changeset.html]
aws_s3_object.redirects["/install/tutorials/enterprisedb.html"]: Refreshing state... [id=/install/tutorials/enterprisedb.html]
aws_s3_object.redirects["/commands/community/quality-checks/multiple-objects.html"]: Refreshing state... [id=/commands/community/quality-checks/multiple-objects.html]
aws_s3_object.redirects["/operation-reports.html"]: Refreshing state... [id=/operation-reports.html]
aws_s3_object.redirects["/custom-policy-checks"]: Refreshing state... [id=/custom-policy-checks]
aws_s3_object.redirects["/start/tutorials/mongodb-pro/using-mongosh-changelog.html"]: Refreshing state... [id=/start/tutorials/mongodb-pro/using-mongosh-changelog.html]
aws_s3_object.redirects["/commands/maintenance/release-locks.html"]: Refreshing state... [id=/commands/maintenance/release-locks.html]
aws_s3_object.redirects["/concepts/changes/faq.html"]: Refreshing state... [id=/concepts/changes/faq.html]
aws_s3_object.redirects["/start/getting-started-with-liquibase-and-xml-on-windows.html"]: Refreshing state... [id=/start/getting-started-with-liquibase-and-xml-on-windows.html]
aws_s3_object.redirects["/tools-integrations/liquibase-hub/operations.html"]: Refreshing state... [id=/tools-integrations/liquibase-hub/operations.html]
aws_s3_object.redirects["/install/tutorials/voltdb.html"]: Refreshing state... [id=/install/tutorials/voltdb.html]
aws_s3_object.redirects["/commands/marknextchangesetran.html"]: Refreshing state... [id=/commands/marknextchangesetran.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/mongodb"]: Refreshing state... [id=/workflows/database-setup-tutorials/mongodb]
aws_s3_object.redirects["/documentation/labels.html"]: Refreshing state... [id=/documentation/labels.html]
aws_s3_object.redirects["/change-types/community/drop-not-null-constraint.html"]: Refreshing state... [id=/change-types/community/drop-not-null-constraint.html]
aws_s3_object.redirects["/commands/community/quality-checks/checks-reset.html"]: Refreshing state... [id=/commands/community/quality-checks/checks-reset.html]
aws_s3_object.redirects["/tools-integrations/ant/commands/marknextchangesetran.html"]: Refreshing state... [id=/tools-integrations/ant/commands/marknextchangesetran.html]
aws_s3_object.redirects["/concepts/changelogs/attributes/changeset-elements-and-attributes.html"]: Refreshing state... [id=/concepts/changelogs/attributes/changeset-elements-and-attributes.html]
aws_s3_object.redirects["/commands/diff.html"]: Refreshing state... [id=/commands/diff.html]
aws_s3_object.redirects["/start/getting-started-with-liquibase-and-sql-on-linux-macos.html"]: Refreshing state... [id=/start/getting-started-with-liquibase-and-sql-on-linux-macos.html]
aws_s3_object.redirects["/concepts/preconditions.html"]: Refreshing state... [id=/concepts/preconditions.html]
aws_s3_object.redirects["/tools-integrations/springboot/springboot.html"]: Refreshing state... [id=/tools-integrations/springboot/springboot.html]
aws_s3_object.redirects["/commands/quality-checks/reset.html"]: Refreshing state... [id=/commands/quality-checks/reset.html]
aws_s3_object.redirects["/commands/maintenance/validate.html"]: Refreshing state... [id=/commands/maintenance/validate.html]
aws_s3_object.redirects["/concepts/changelogs/attributes/using-sql-plus-integration.html"]: Refreshing state... [id=/concepts/changelogs/attributes/using-sql-plus-integration.html]
aws_s3_object.redirects["/commands/maintenance/changelog-sync-sql.html"]: Refreshing state... [id=/commands/maintenance/changelog-sync-sql.html]
aws_s3_object.redirects["/commands/community/faq.html"]: Refreshing state... [id=/commands/community/faq.html]
aws_s3_object.redirects["/commands/quality-checks/checks-show.html"]: Refreshing state... [id=/commands/quality-checks/checks-show.html]
aws_s3_object.redirects["/tools-integrations/ant/commands/dbdoc.html"]: Refreshing state... [id=/tools-integrations/ant/commands/dbdoc.html]
aws_s3_object.redirects["/commands/community/validate.html"]: Refreshing state... [id=/commands/community/validate.html]
aws_s3_object.redirects["/commands/liquibase-start/init-project.html"]: Refreshing state... [id=/commands/liquibase-start/init-project.html]
aws_s3_object.redirects["/commands/tag.html"]: Refreshing state... [id=/commands/tag.html]
aws_s3_object.redirects["/custom-policy-checks.html"]: Refreshing state... [id=/custom-policy-checks.html]
aws_s3_object.redirects["/install/sybase-anywhere.html"]: Refreshing state... [id=/install/sybase-anywhere.html]
aws_s3_object.redirects["/start/install/tutorials/sap-adaptive-server-enterprise-sap-ase.html"]: Refreshing state... [id=/start/install/tutorials/sap-adaptive-server-enterprise-sap-ase.html]
aws_s3_object.redirects["/change-types/pro/create-function.html"]: Refreshing state... [id=/change-types/pro/create-function.html]
aws_s3_object.redirects["/commands/dropall.html"]: Refreshing state... [id=/commands/dropall.html]
aws_s3_object.redirects["/concepts/basic/changelog-property-substitution.html"]: Refreshing state... [id=/concepts/basic/changelog-property-substitution.html]
aws_s3_object.redirects["/commands/community/quality-checks/checks-enable.html"]: Refreshing state... [id=/commands/community/quality-checks/checks-enable.html]
aws_s3_object.redirects["/commands/community/snapshotreference.html"]: Refreshing state... [id=/commands/community/snapshotreference.html]
aws_s3_object.redirects["/commands/liquibase-environment-variables.html"]: Refreshing state... [id=/commands/liquibase-environment-variables.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-rollbackOneUpdate.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-rollbackOneUpdate.html]
aws_s3_object.redirects["/concepts/advanced/column.html"]: Refreshing state... [id=/concepts/advanced/column.html]
aws_s3_object.redirects["/commands/futurerollbackcountsql.html"]: Refreshing state... [id=/commands/futurerollbackcountsql.html]
aws_s3_object.redirects["/commands/quality-checks/table-comment-check.html"]: Refreshing state... [id=/commands/quality-checks/table-comment-check.html]
aws_s3_object.redirects["/change-types/pro/disable-trigger.html"]: Refreshing state... [id=/change-types/pro/disable-trigger.html]
aws_s3_object.redirects["/change-types/community/add-default-value.html"]: Refreshing state... [id=/change-types/community/add-default-value.html]
aws_s3_object.redirects["/install/tutorials/mssql-integrated-security-kerberos-authentication.html"]: Refreshing state... [id=/install/tutorials/mssql-integrated-security-kerberos-authentication.html]
aws_s3_object.redirects["/commands/config-ref/liquibase-tablespace-name.html"]: Refreshing state... [id=/commands/config-ref/liquibase-tablespace-name.html]
aws_s3_object.redirects["/secrets-management/cyberark-pam-vault.html"]: Refreshing state... [id=/secrets-management/cyberark-pam-vault.html]
aws_s3_object.redirects["/install/tutorials/cloud-spanner.html"]: Refreshing state... [id=/install/tutorials/cloud-spanner.html]
aws_s3_object.redirects["/feature-flags/readmes/Example.html"]: Refreshing state... [id=/feature-flags/readmes/Example.html]
aws_s3_object.redirects["/commands/community/rollbacktodate.html"]: Refreshing state... [id=/commands/community/rollbacktodate.html]
aws_s3_object.redirects["/start/tutorials/hibernate.html"]: Refreshing state... [id=/start/tutorials/hibernate.html]
aws_s3_object.redirects["/concepts/changelogs/attributes/enddelimiter-sql.html"]: Refreshing state... [id=/concepts/changelogs/attributes/enddelimiter-sql.html]
aws_s3_object.redirects["/start/install/tutorials/cockroachdb.html"]: Refreshing state... [id=/start/install/tutorials/cockroachdb.html]
aws_s3_object.redirects["/start/install/tutorials/teradata.html"]: Refreshing state... [id=/start/install/tutorials/teradata.html]
aws_s3_object.redirects["/commands/quality-checks/checks/sql-server-reserved-keywords.html"]: Refreshing state... [id=/commands/quality-checks/checks/sql-server-reserved-keywords.html]
aws_s3_object.redirects["/commands/quality-checks/checks/changeset-comment-check.html"]: Refreshing state... [id=/commands/quality-checks/checks/changeset-comment-check.html]
aws_s3_object.redirects["/commands/community/history.html"]: Refreshing state... [id=/commands/community/history.html]
aws_s3_object.redirects["/workflows"]: Refreshing state... [id=/workflows]
aws_s3_object.redirects["/commands/rollbacktodatesql.html"]: Refreshing state... [id=/commands/rollbacktodatesql.html]
aws_s3_object.redirects["/start/tutorials/vertica.html"]: Refreshing state... [id=/start/tutorials/vertica.html]
aws_s3_object.redirects["/operation-reports"]: Refreshing state... [id=/operation-reports]
aws_s3_object.redirects["/tools-integrations/remote-files/remote-file-path-rules.html"]: Refreshing state... [id=/tools-integrations/remote-files/remote-file-path-rules.html]
aws_s3_object.redirects["/databasechangeloghistory"]: Refreshing state... [id=/databasechangeloghistory]
aws_s3_object.redirects["/commands/updatesql.html"]: Refreshing state... [id=/commands/updatesql.html]
aws_s3_object.redirects["/start/tutorials/teradata.html"]: Refreshing state... [id=/start/tutorials/teradata.html]
aws_s3_object.redirects["/concepts/advanced/logicalfilepath.html"]: Refreshing state... [id=/concepts/advanced/logicalfilepath.html]
aws_s3_object.redirects["/concepts/basic/xml-format.html"]: Refreshing state... [id=/concepts/basic/xml-format.html]
aws_s3_object.redirects["/start/install/tutorials/cosmosdb.html"]: Refreshing state... [id=/start/install/tutorials/cosmosdb.html]
aws_s3_object.redirects["/commands/execute-sql.html"]: Refreshing state... [id=/commands/execute-sql.html]
aws_s3_object.redirects["/start/install/tutorials/maxdb.html"]: Refreshing state... [id=/start/install/tutorials/maxdb.html]
aws_s3_object.redirects["/change-types/pro/create-package.html"]: Refreshing state... [id=/change-types/pro/create-package.html]
aws_s3_object.redirects["/concepts/installation/upgrading-liquibase.html"]: Refreshing state... [id=/concepts/installation/upgrading-liquibase.html]
aws_s3_object.redirects["/commands/community/updatesql.html"]: Refreshing state... [id=/commands/community/updatesql.html]
aws_s3_object.redirects["/commands/pro/diff-json.html"]: Refreshing state... [id=/commands/pro/diff-json.html]
aws_s3_object.redirects["/commands/community/updatecountsql.html"]: Refreshing state... [id=/commands/community/updatecountsql.html]
aws_s3_object.redirects["/commands/quality-checks/checks/constraint-must-exist.html"]: Refreshing state... [id=/commands/quality-checks/checks/constraint-must-exist.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/maxdb.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/maxdb.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/cassandra.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/cassandra.html]
aws_s3_object.redirects["/start/install/tutorials/apache-derby.html"]: Refreshing state... [id=/start/install/tutorials/apache-derby.html]
aws_s3_object.redirects["/start/install/tutorials/snowflake.html"]: Refreshing state... [id=/start/install/tutorials/snowflake.html]
aws_s3_object.redirects["/concepts/yaml-format.html"]: Refreshing state... [id=/concepts/yaml-format.html]
aws_s3_object.redirects["/secrets-management"]: Refreshing state... [id=/secrets-management]
aws_s3_object.redirects["/parameters/ignore.html"]: Refreshing state... [id=/parameters/ignore.html]
aws_s3_object.redirects["/tools-integrations/feature-flags/readmes/gitlab-feature-flags-extension.html"]: Refreshing state... [id=/tools-integrations/feature-flags/readmes/gitlab-feature-flags-extension.html]
aws_s3_object.redirects["/feature-flags/readmes/Supported Editions.html"]: Refreshing state... [id=/feature-flags/readmes/Supported Editions.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-list-locks.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-list-locks.html]
aws_s3_object.redirects["/commands/maintenance/changelog-sync.html"]: Refreshing state... [id=/commands/maintenance/changelog-sync.html]
aws_s3_object.redirects["/change-types/community/create-procedure.html"]: Refreshing state... [id=/change-types/community/create-procedure.html]
aws_s3_object.redirects["/commands/pro/checks-bulk-set.html"]: Refreshing state... [id=/commands/pro/checks-bulk-set.html]
aws_s3_object.redirects["/workflows/liquibase-community/run-liquibase-without-launch-scripts.html"]: Refreshing state... [id=/workflows/liquibase-community/run-liquibase-without-launch-scripts.html]
aws_s3_object.redirects["/feature-flags/readmes/Usage.html"]: Refreshing state... [id=/feature-flags/readmes/Usage.html]
aws_s3_object.redirects["/commands/flow/advance-flow-file.html"]: Refreshing state... [id=/commands/flow/advance-flow-file.html]
aws_s3_object.redirects["/commands/rollbacksqltag.html"]: Refreshing state... [id=/commands/rollbacksqltag.html]
aws_s3_object.redirects["/tools-integrations/ant/commands/updatedatabase.html"]: Refreshing state... [id=/tools-integrations/ant/commands/updatedatabase.html]
aws_s3_object.redirects["/commands/status/verbose.html"]: Refreshing state... [id=/commands/status/verbose.html]
aws_s3_object.redirects["/start/install/tutorials/yugabytedb.html"]: Refreshing state... [id=/start/install/tutorials/yugabytedb.html]
aws_s3_object.redirects["/commands/quality-checks/checks/changelog-checks/sql-server-reserved-keywords.html"]: Refreshing state... [id=/commands/quality-checks/checks/changelog-checks/sql-server-reserved-keywords.html]
aws_s3_object.redirects["/commands/community/diff.html"]: Refreshing state... [id=/commands/community/diff.html]
aws_s3_object.redirects["/commands/quality-checks/show.html"]: Refreshing state... [id=/commands/quality-checks/show.html]
aws_s3_object.redirects["/commands/config-ref/objectquotingstrategy.html"]: Refreshing state... [id=/commands/config-ref/objectquotingstrategy.html]
aws_s3_object.redirects["/start/tutorials/voltdb.html"]: Refreshing state... [id=/start/tutorials/voltdb.html]
aws_s3_object.redirects["/concepts/databasechangelog.html"]: Refreshing state... [id=/concepts/databasechangelog.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.7.1.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.7.1.html]
aws_s3_object.redirects["/commands/quality-checks/working-with-quality-checks.html"]: Refreshing state... [id=/commands/quality-checks/working-with-quality-checks.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-dbDoc.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-dbDoc.html]
aws_s3_object.redirects["/start/getting-started-liquibase-yaml-linux-macos.html"]: Refreshing state... [id=/start/getting-started-liquibase-yaml-linux-macos.html]
aws_s3_object.redirects["/start/tutorials/db2-luw.html"]: Refreshing state... [id=/start/tutorials/db2-luw.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-releaseLocks.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-releaseLocks.html]
aws_s3_object.redirects["/commands/quality-checks/checks/warn-on-use-database.html"]: Refreshing state... [id=/commands/quality-checks/checks/warn-on-use-database.html]
aws_s3_object.redirects["/change-types/pro/disable-check-constraint.html"]: Refreshing state... [id=/change-types/pro/disable-check-constraint.html]
aws_s3_object.redirects["/concepts/changelogs/attributes/end-delimiter-sql.html"]: Refreshing state... [id=/concepts/changelogs/attributes/end-delimiter-sql.html]
aws_s3_object.redirects["/change-types/community/empty.html"]: Refreshing state... [id=/change-types/community/empty.html]
aws_s3_object.redirects["/start/getting-started-liquibase-yaml.html"]: Refreshing state... [id=/start/getting-started-liquibase-yaml.html]
aws_s3_object.redirects["/change-types/community/create-table.html"]: Refreshing state... [id=/change-types/community/create-table.html]
aws_s3_object.redirects["/change-types/community/drop-index.html"]: Refreshing state... [id=/change-types/community/drop-index.html]
aws_s3_object.redirects["/concepts/changelogs/runwith.html"]: Refreshing state... [id=/concepts/changelogs/runwith.html]
aws_s3_object.redirects["/commands/community/synchub.html"]: Refreshing state... [id=/commands/community/synchub.html]
aws_s3_object.redirects["/concepts/installation/running-first-update-installer.html"]: Refreshing state... [id=/concepts/installation/running-first-update-installer.html]
aws_s3_object.redirects["/2014/11/contexts-vs-labels.html"]: Refreshing state... [id=/2014/11/contexts-vs-labels.html]
aws_s3_object.redirects["/concepts/installation/setup-workspace-installer.html"]: Refreshing state... [id=/concepts/installation/setup-workspace-installer.html]
aws_s3_object.redirects["/commands/pro/rollbackoneupdate.html"]: Refreshing state... [id=/commands/pro/rollbackoneupdate.html]
aws_s3_object.redirects["/commands/updatecount.html"]: Refreshing state... [id=/commands/updatecount.html]
aws_s3_object.redirects["/concepts/xml-format.html"]: Refreshing state... [id=/concepts/xml-format.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.19.0.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.19.0.html]
aws_s3_object.redirects["/commands/help.html"]: Refreshing state... [id=/commands/help.html]
aws_s3_object.redirects["/commands/quality-checks/checks/table-comment-pattern-check.html"]: Refreshing state... [id=/commands/quality-checks/checks/table-comment-pattern-check.html]
aws_s3_object.redirects["/change-types/community/add-not-null-constraint.html"]: Refreshing state... [id=/change-types/community/add-not-null-constraint.html]
aws_s3_object.redirects["/commands/quality-checks/checks/sql-grant-option-warn.html"]: Refreshing state... [id=/commands/quality-checks/checks/sql-grant-option-warn.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/impala-hive.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/impala-hive.html]
aws_s3_object.redirects["/commands/status-verbose.html"]: Refreshing state... [id=/commands/status-verbose.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.22.0.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.22.0.html]
aws_s3_object.redirects["/start/install/tutorials/bigquery.html"]: Refreshing state... [id=/start/install/tutorials/bigquery.html]
aws_s3_object.redirects["/tools-integrations/labs/variables.html"]: Refreshing state... [id=/tools-integrations/labs/variables.html]
aws_s3_object.redirects["/install/home.html"]: Refreshing state... [id=/install/home.html]
aws_s3_object.redirects["/parameters/objectquotingstrategy.html"]: Refreshing state... [id=/parameters/objectquotingstrategy.html]
aws_s3_object.redirects["/2014/11/faq.html"]: Refreshing state... [id=/2014/11/faq.html]
aws_s3_object.redirects["/concepts/advanced/changelog-lock-wait-time-in-minutes-parameter.html"]: Refreshing state... [id=/concepts/advanced/changelog-lock-wait-time-in-minutes-parameter.html]
aws_s3_object.redirects["/commands/status/history.html"]: Refreshing state... [id=/commands/status/history.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/mssql-windows-integrated-security.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/mssql-windows-integrated-security.html]
aws_s3_object.redirects["/concepts/changelogs/attributes/sql-plus-troubleshoot.html"]: Refreshing state... [id=/concepts/changelogs/attributes/sql-plus-troubleshoot.html]
aws_s3_object.redirects["/install/tutorials/hibernate.html"]: Refreshing state... [id=/install/tutorials/hibernate.html]
aws_s3_object.redirects["/concepts/advanced/driver.html"]: Refreshing state... [id=/concepts/advanced/driver.html]
aws_s3_object.redirects["/change-types/pro/home.html"]: Refreshing state... [id=/change-types/pro/home.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.17.1.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.17.1.html]
aws_s3_object.redirects["/concepts/advanced/database-class.html"]: Refreshing state... [id=/concepts/advanced/database-class.html]
aws_s3_object.redirects["/feature-flags/readmes/Flagsmith Feature Flags Extension.html"]: Refreshing state... [id=/feature-flags/readmes/Flagsmith Feature Flags Extension.html]
aws_s3_object.redirects["/commands/quality-checks/checks-enable.html"]: Refreshing state... [id=/commands/quality-checks/checks-enable.html]
aws_s3_object.redirects["/start/install/tutorials/db2onz.html"]: Refreshing state... [id=/start/install/tutorials/db2onz.html]
aws_s3_object.redirects["/commands/quality-checks/constraint-must-exist.html"]: Refreshing state... [id=/commands/quality-checks/constraint-must-exist.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/cassandra-astra.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/cassandra-astra.html]
aws_s3_object.redirects["/commands/change-tracking/changelog-sync-to-tag-sql.html"]: Refreshing state... [id=/commands/change-tracking/changelog-sync-to-tag-sql.html]
aws_s3_object.redirects["/concepts/changelogs/include.html"]: Refreshing state... [id=/concepts/changelogs/include.html]
aws_s3_object.redirects["/tools-integrations/liquibase-hub/home.html"]: Refreshing state... [id=/tools-integrations/liquibase-hub/home.html]
aws_s3_object.redirects["/tools-integrations/ant/commands/rollbackfuturedatabase.html"]: Refreshing state... [id=/tools-integrations/ant/commands/rollbackfuturedatabase.html]
aws_s3_object.redirects["/change-types/community/delete.html"]: Refreshing state... [id=/change-types/community/delete.html]
aws_s3_object.redirects["/commands/quality-checks/checks/object-name-must-not-match.html"]: Refreshing state... [id=/commands/quality-checks/checks/object-name-must-not-match.html]
aws_s3_object.redirects["/commands/quality-checks/checks/table-comment-check.html"]: Refreshing state... [id=/commands/quality-checks/checks/table-comment-check.html]
aws_s3_object.redirects["/start/install/tutorials/sap-hana.html"]: Refreshing state... [id=/start/install/tutorials/sap-hana.html]
aws_s3_object.redirects["/commands/changelogsynctotagsql.html"]: Refreshing state... [id=/commands/changelogsynctotagsql.html]
aws_s3_object.redirects["/commands/diff-json.html"]: Refreshing state... [id=/commands/diff-json.html]
aws_s3_object.redirects["/start/get-started/getting-started-liquibase-json-linux.html"]: Refreshing state... [id=/start/get-started/getting-started-liquibase-json-linux.html]
aws_s3_object.redirects["/concepts/advanced/using-the-changelogfile-logfile-outputfile-parameters.html"]: Refreshing state... [id=/concepts/advanced/using-the-changelogfile-logfile-outputfile-parameters.html]
aws_s3_object.redirects["/change-types/community/update.html"]: Refreshing state... [id=/change-types/community/update.html]
aws_s3_object.redirects["/commands/quality-checks/checks/lab-quality-checks.html"]: Refreshing state... [id=/commands/quality-checks/checks/lab-quality-checks.html]
aws_s3_object.redirects["/concepts/advanced/contexts.html"]: Refreshing state... [id=/concepts/advanced/contexts.html]
aws_s3_object.redirects["/tools-integrations/ant/commands/changelogsynctotag.html"]: Refreshing state... [id=/tools-integrations/ant/commands/changelogsynctotag.html]
aws_s3_object.redirects["/commands/pro/rollbackonechangesetsql.html"]: Refreshing state... [id=/commands/pro/rollbackonechangesetsql.html]
aws_s3_object.redirects["/commands/config-ref/database-class.html"]: Refreshing state... [id=/commands/config-ref/database-class.html]
aws_s3_object.redirects["/commands/deactivatechangelog.html"]: Refreshing state... [id=/commands/deactivatechangelog.html]
aws_s3_object.redirects["/tools-integrations/ant/commands/rollbackdatabase.html"]: Refreshing state... [id=/tools-integrations/ant/commands/rollbackdatabase.html]
aws_s3_object.redirects["/concepts/installation/using-the-lb-installer.html"]: Refreshing state... [id=/concepts/installation/using-the-lb-installer.html]
aws_s3_object.redirects["/workflows/liquibase-community/modify-sql.html"]: Refreshing state... [id=/workflows/liquibase-community/modify-sql.html]
aws_s3_object.redirects["/start/install/tutorials/informix.html"]: Refreshing state... [id=/start/install/tutorials/informix.html]
aws_s3_object.redirects["/change-types/community/drop-sequence.html"]: Refreshing state... [id=/change-types/community/drop-sequence.html]
aws_s3_object.redirects["/commands/config-ref/always-override-stored-logic-schema.html"]: Refreshing state... [id=/commands/config-ref/always-override-stored-logic-schema.html]
aws_s3_object.redirects["/tools-integrations/community-supported/home.html"]: Refreshing state... [id=/tools-integrations/community-supported/home.html]
aws_s3_object.redirects["/install/tutorials/db2onz.html"]: Refreshing state... [id=/install/tutorials/db2onz.html]
aws_s3_object.redirects["/workflows/liquibase-community/running-liquibase-percona-toolkit-changes.html"]: Refreshing state... [id=/workflows/liquibase-community/running-liquibase-percona-toolkit-changes.html]
aws_s3_object.redirects["/concepts/advanced/generated-changeset-ids-contains-description.html"]: Refreshing state... [id=/concepts/advanced/generated-changeset-ids-contains-description.html]
aws_s3_object.redirects["/commands/quality-checks/checks/change-truncate-table-warn.html"]: Refreshing state... [id=/commands/quality-checks/checks/change-truncate-table-warn.html]
aws_s3_object.redirects["/workflows/liquibase-community/using-the-jenkins-pipeline-stage-with-spinnaker.html"]: Refreshing state... [id=/workflows/liquibase-community/using-the-jenkins-pipeline-stage-with-spinnaker.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-dropAll.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-dropAll.html]
aws_s3_object.redirects["/commands/change-tracking/mark-next-changeset-ran-sql.html"]: Refreshing state... [id=/commands/change-tracking/mark-next-changeset-ran-sql.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-deactivate-changelog.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-deactivate-changelog.html]
aws_s3_object.redirects["/concepts/labels.html"]: Refreshing state... [id=/concepts/labels.html]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_s3_object.redirects["/dropall"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/dropall"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/utility/drop-all.html" -> "/commands/utility/drop-all.html "
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/dropall.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/dropall.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/utility/drop-all.html" -> "/commands/utility/drop-all.html "
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/s3"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/s3"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/extensions/remote-files/s3.html" -> "/liquibase-pro/remote-files/s3.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/s3.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/s3.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/extensions/remote-files/s3.html" -> "/liquibase-pro/remote-files/s3.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/secrets-management"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/secrets-management"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/extensions/secrets-management/home.html" -> "/liquibase-pro/secrets-management/home.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/secrets-management.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/secrets-management.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/extensions/secrets-management/home.html" -> "/liquibase-pro/secrets-management/home.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/secrets-management/aws-secrets-mgr.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/secrets-management/aws-secrets-mgr.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/extensions/secrets-management/aws-secrets-mgr.html" -> "/liquibase-pro/secrets-management/aws-secrets-mgr.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/secrets-management/hashicorp-vault.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/secrets-management/hashicorp-vault.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/extensions/secrets-management/hashicorp-vault.html" -> "/liquibase-pro/secrets-management/hashicorp-vault.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/secrets-management/home.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/secrets-management/home.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/extensions/secrets-management/home.html" -> "/liquibase-pro/secrets-management/home.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/extensions/remote-files/remote-file-path-rules.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/extensions/remote-files/remote-file-path-rules.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/remote-files/remote-file-path-rules.html"
    }

  # aws_s3_object.redirects["/tools-integrations/extensions/remote-files/s3-commands.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/extensions/remote-files/s3-commands.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/remote-files/s3-commands.html"
    }

  # aws_s3_object.redirects["/tools-integrations/extensions/remote-files/s3.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/extensions/remote-files/s3.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/remote-files/s3.html"
    }

  # aws_s3_object.redirects["/tools-integrations/extensions/remote-files/searchpath.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/extensions/remote-files/searchpath.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/remote-files/searchpath.html"
    }

  # aws_s3_object.redirects["/tools-integrations/extensions/secrets-management/aws-secrets-mgr.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/extensions/secrets-management/aws-secrets-mgr.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/secrets-management/aws-secrets-mgr.html"
    }

  # aws_s3_object.redirects["/tools-integrations/extensions/secrets-management/hashicorp-vault.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/extensions/secrets-management/hashicorp-vault.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/secrets-management/hashicorp-vault.html"
    }

  # aws_s3_object.redirects["/tools-integrations/extensions/secrets-management/home.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/extensions/secrets-management/home.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/secrets-management/home.html"
    }

  # aws_s3_object.redirects["/tools-integrations/remote-files/create-changelogs-s3.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/remote-files/create-changelogs-s3.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/extensions/remote-files/s3.html" -> "/liquibase-pro/remote-files/s3.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/remote-files/remote-file-path-rules.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/remote-files/remote-file-path-rules.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/extensions/remote-files/remote-file-path-rules.html" -> "/liquibase-pro/remote-files/remote-file-path-rules.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/remote-files/s3-commands.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/remote-files/s3-commands.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/extensions/remote-files/s3-commands.html" -> "/liquibase-pro/remote-files/s3-commands.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/remote-files/s3.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/remote-files/s3.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/extensions/remote-files/s3.html" -> "/liquibase-pro/remote-files/s3.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/remote-files/searchpath.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/remote-files/searchpath.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/extensions/remote-files/searchpath.html" -> "/liquibase-pro/remote-files/searchpath.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/secrets-management/aws-secrets-mgr.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/secrets-management/aws-secrets-mgr.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/extensions/secrets-management/aws-secrets-mgr.html" -> "/liquibase-pro/secrets-management/aws-secrets-mgr.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/secrets-management/hashicorp-vault.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/secrets-management/hashicorp-vault.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/extensions/secrets-management/hashicorp-vault.html" -> "/liquibase-pro/secrets-management/hashicorp-vault.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/secrets-management/home.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/secrets-management/home.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/extensions/secrets-management/home.html" -> "/liquibase-pro/secrets-management/home.html"
        # (11 unchanged attributes hidden)
    }

Plan: 7 to add, 17 to change, 0 to destroy.

[01J47R2WG5ZSKZ4H1R602M1A0E] Changes are GO
[01J47R2WG5ZSKZ4H1R602M1A0E] Uploading the list of managed resources...
[01J47R2WG5ZSKZ4H1R602M1A0E] Generating Infracost JSON report from plan

[01J47R2WG5ZSKZ4H1R602M1A0E] Infracost report generated successfully
[01J47R2WG5ZSKZ4H1R602M1A0E] Mapping Infracost data to resources
[01J47R2WG5ZSKZ4H1R602M1A0E] Costs mapped successfully
[01J47R2WG5ZSKZ4H1R602M1A0E] Please be aware that the run changes calculation includes output changes.
[01J47R2WG5ZSKZ4H1R602M1A0E] Resource list upload is GO
[01J47R2WG5ZSKZ4H1R602M1A0E] Generating JSON representation of the plan...
[01J47R2WG5ZSKZ4H1R602M1A0E] JSON representation is GO
[01J47R2WG5ZSKZ4H1R602M1A0E] Generating Infracost JSON report from plan

[01J47R2WG5ZSKZ4H1R602M1A0E] Infracost report generated successfully
[01J47R2WG5ZSKZ4H1R602M1A0E] Loading custom plan policy inputs...
[01J47R2WG5ZSKZ4H1R602M1A0E] 0 custom plan policy inputs found
[01J47R2WG5ZSKZ4H1R602M1A0E] No plan policies to evaluate
```

</details>